Project/Toir/src/Catalogs/НоменклатураКласса/НоменклатураКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НоменклатураКласса</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержитНоменклатуруКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектТОиР</name>
    <type>
      <types>CatalogRef</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/InformationRegisters/МножественныеЗначенияАтрибутов/МножественныеЗначенияАтрибутов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>МножественныеЗначенияАтрибутов</name>
  <resources>
    <name>ДоступноеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ИспользуемоеЗначение</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>Порядок</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТабличныйАтрибут</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Класс</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>CatalogRef.НаборыАтрибутов</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеАтрибутаКласса</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.ВариантыЗначенийАтрибутовКласса</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/НенаследуемыеЗначения/НенаследуемыеЗначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НенаследуемыеЗначения</name>
  <resources>
    <name>НеНаследуемыйАтрибут</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Класс</name>
    <type>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>CatalogRef.НаборыАтрибутов</types>
      <types>CatalogRef.ВложенныеАтрибутыКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗначениеАтрибутаКласса</name>
    <type>
      <types>Characteristic.АтрибутыКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/InformationRegisters/ЗначенияАтрибутовКласса/ЗначенияАтрибутовКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЗначенияАтрибутовКласса</name>
  <resources>
    <name>ЗначениеАтрибутаКласса</name>
    <type>
      <types>Characteristic.АтрибутыКласса</types>
    </type>
  </resources>
  <dimensions>
    <name>Класс</name>
    <type>
      <types>CatalogRef.ОбъектыНоменклатуры</types>
      <types>CatalogRef.Классы</types>
      <types>CatalogRef.НоменклатураКласса</types>
    </type>
  </dimensions>
  <dimensions>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Enums/РеквизитыКлассаНоменклатуры/РеквизитыКлассаНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>РеквизитыКлассаНоменклатуры</name>
  <enumValues>
    <name>Код</name>
  </enumValues>
  <enumValues>
    <name>Статус</name>
  </enumValues>
  <enumValues>
    <name>Родитель</name>
  </enumValues>
</mdclass:Enum>

Project/Toir/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>ВидыТехОпераций</name>
      <description>Виды тех.операции</description>
    </items>
    <items>
      <name>ВложенныеТехКарты</name>
      <description>Вложенные тех карты</description>
    </items>
    <items>
      <name>КлассыТехКарт</name>
      <description>Классы тех. карт</description>
    </items>
    <items>
      <name>СтрокиТехОпераций</name>
      <description>Строки тех.операций</description>
    </items>
    <items>
      <name>ТехнологическиеКарты</name>
      <description>Технологические карты</description>
    </items>
    <items>
      <name>ТипыТехКарт</name>
      <description>Типы тех. карт</description>
    </items>
    <items>
      <name>Оборудование</name>
      <description>Оборудование</description>
    </items>
  </predefined>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыОбъектовНСИ</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтображатьВИерархииТО</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗначениеАтрибута</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатураКласса</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектыНоменклатуры</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КлассТабличнаяЧасть</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаКласса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияКласса</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияНоменклатуры</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонКодаОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>ФорматКодаОбъекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШаблонНаименованияОбъекта</name>
    <type>
      <types>CatalogRef.ШаблоныЗаполнения</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикКлассов</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикОбъектовНоменклатуры</name>
    <type>
      <types>CatalogRef.Счетчики</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПоСчетчику</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ШагСчетчика</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПрисвоенНомерПоШаблону</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РежимКонтроляДублейПоНаименованию</name>
    <type>
      <types>EnumRef.РежимыКонтроляДублей</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрольДублейВПределахКласса</name>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/ВложенныеАтрибутыКласса/ВложенныеАтрибутыКласса.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВложенныеАтрибутыКласса</name>
  <attributes>
    <name>Источник</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>CatalogRef.ВложенныеАтрибутыКласса</types>
    </type>
  </attributes>
  <attributes>
    <name>АтрибутКласса</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.АтрибутыКласса</types>
      <types>EnumRef.РеквизитыКлассаНоменклатуры</types>
    </type>
  </attributes>
</mdclass:Catalog>

Project/Toir/src/Catalogs/НоменклатураКласса/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция ПолучитьРодителяПоКлассу(Класс) Экспорт
	
	ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(Класс);
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаРодителей", ТаблицаРодителей);
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТаблицаРодителей.Класс,
		|	ТаблицаРодителей.Уровень
		|ПОМЕСТИТЬ ВТ_ТаблицаРодителей
		|ИЗ
		|	&ТаблицаРодителей КАК ТаблицаРодителей
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ВТ_ТаблицаРодителей.Уровень) КАК Уровень
		|ПОМЕСТИТЬ ВТ_МаксУровень
		|ИЗ
		|	Справочник.Классы КАК Классы
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаРодителей КАК ВТ_ТаблицаРодителей
		|		ПО Классы.Ссылка = ВТ_ТаблицаРодителей.Класс
		|ГДЕ
		|	Классы.ОтображатьВИерархииТО
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ ПЕРВЫЕ 1
		|	НоменклатураКласса.Ссылка,
		|	НоменклатураКласса.ПометкаУдаления КАК ПометкаУдаления,
		|	НоменклатураКласса.Класс.ПометкаУдаления КАК ПометкаУдаленияВладельца
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаРодителей КАК ВТ_ТаблицаРодителей
		|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_МаксУровень КАК ВТ_МаксУровень
		|			ПО ВТ_ТаблицаРодителей.Уровень = ВТ_МаксУровень.Уровень
		|		ПО НоменклатураКласса.Класс = ВТ_ТаблицаРодителей.Класс
		|ГДЕ
		|	НоменклатураКласса.ЭтоГруппа
		|
		|УПОРЯДОЧИТЬ ПО
		|	ПометкаУдаления УБЫВ";
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Родитель = Результат.Ссылка;
	Иначе
		Родитель = Справочники.НоменклатураКласса.ПустаяСсылка();
	КонецЕсли;
	
	Возврат Родитель;
	
КонецФункции

Функция ПрочитатьДанныеДляЧтенияНоменклатуры(МассивНоменклатуры) Экспорт
	
	// Получаем классы номенклатуры.
	СоответствиеКлассов = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначениеРеквизитаОбъектов(
		МассивНоменклатуры, "Класс");
	
	// Соответствие номенклатуры - позволяет по классу определить номенклатуру класса.
	СоответствиеНоменклатуры = Новый Соответствие; 
	МассивКлассов = Новый Массив; // Массив классов нужен для чтения шаблонов табличных атрибутов.
	Для Каждого КлючИЗначение ИЗ СоответствиеКлассов Цикл
		МассивНоменклатурыПоКлассам = СоответствиеНоменклатуры[КлючИЗначение.Значение];
		Если МассивНоменклатурыПоКлассам = Неопределено Тогда
			МассивНоменклатурыПоКлассам = Новый Массив;
			СоответствиеНоменклатуры.Вставить(КлючИЗначение.Значение, МассивНоменклатурыПоКлассам);
			МассивКлассов.Добавить(КлючИЗначение.Значение);
		КонецЕсли;
		МассивНоменклатурыПоКлассам.Добавить(КлючИЗначение.Ключ);
	КонецЦикла;
	
	Возврат Новый Структура("СоответствиеКлассов, СоответствиеНоменклатуры, МассивКлассов", 
		СоответствиеКлассов, СоответствиеНоменклатуры, МассивКлассов);
	
КонецФункции

Функция ПолучитьТаблицуАтрибутов(Знач Номенклатура, ДанныеДляЧтения = Неопределено, МенеджерВТ=Неопределено, ЧитатьВложенныеАтрибуты=Истина) Экспорт
	
	Если НЕ ТипЗнч(Номенклатура) = Тип("Массив") Тогда
		НовыйМассив = Новый Массив;
		НовыйМассив.Добавить(Номенклатура);
		Номенклатура = НовыйМассив;
	КонецЕсли;
	
	Если ДанныеДляЧтения = Неопределено Тогда
		ДанныеДляЧтения = ПрочитатьДанныеДляЧтенияНоменклатуры(Номенклатура);
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	
	Если МенеджерВТ = Неопределено Тогда
		Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;
	
	СписокРодителей  = Справочники.Классы.ПолучитьТаблицуРодителей(ДанныеДляЧтения.МассивКлассов);
	Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей, Запрос.МенеджерВременныхТаблиц); // ВТ_ТаблицаАтрибутов
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = ТекстЗапросаЗначенияАтрибутовНоменклатуры(); // ВТ_НоменклатураКласса, ВТ_АтрибутыНоменклатуры, ВТ_ВложенныеАтрибутыКласса
	Запрос.Выполнить();
	
	Если ЧитатьВложенныеАтрибуты Тогда
		Запрос.Текст = ТекстЗапросаВложенныеАтрибуты();
		Результаты = Запрос.ВыполнитьПакет();
		
		МассивКлассовЧтенияВложенныхАтрибутов      = Результаты[0].Выгрузить().ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
		МассивНоменклатурыЧтенияВложенныхАтрибутов = Результаты[1].Выгрузить().ВыгрузитьКолонку("ЗначениеАтрибутаКласса");
		
		ВыборкаВложенныхРеквизитовПоТипам          = Результаты[2].Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		ТаблицаВложенныхРеквизитов = Новый ТаблицаЗначений;
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("Номенклатура", 
			Новый ОписаниеТипов("СправочникСсылка.НоменклатураКласса"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("КлассДляЧтения", 
			Новый ОписаниеТипов("СправочникСсылка.Классы, СправочникСсылка.НоменклатураКласса"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ВложенныйАтрибутКлассаСсылка",
			Новый ОписаниеТипов("СправочникСсылка.ВложенныеАтрибутыКласса"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ТипЗначения", Новый ОписаниеТипов("Строка"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ИсточникВложенногоАтрибутаКласса", 
			Новый ОписаниеТипов("ПланВидовХарактеристикСсылка.АтрибутыКласса"));
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ЗначениеАтрибутаВложенногоКлассаНТ");
		
		МассивТипов = Новый Массив;
		КвалификаторСтрока = Неопределено;
		
		Пока ВыборкаВложенныхРеквизитовПоТипам.Следующий() Цикл
			ВыборкаВложеныхРеквизитовПоОбъектам = ВыборкаВложенныхРеквизитовПоТипам.Выбрать();
			СоответствиеРеквизитовДляЧтения = Новый Соответствие;
			
			ОбходСоЗначениемИсточником = (ТипЗнч(ВыборкаВложенныхРеквизитовПоТипам.ТипЗначенияИсточника) = Тип("Тип"));
			Если ОбходСоЗначениемИсточником Тогда
				МетаданныеСпр = Метаданные.НайтиПоТипу(ВыборкаВложенныхРеквизитовПоТипам.ТипЗначенияИсточника);
				МассивОбъектовДляЧтения = Новый Массив;
				СписокРеквизитов = "";
				
				Пока ВыборкаВложеныхРеквизитовПоОбъектам.Следующий() Цикл
					Если МассивОбъектовДляЧтения.Найти(
							ВыборкаВложеныхРеквизитовПоОбъектам.ЗначениеИсточникаАтрибутаКласса) = Неопределено Тогда
						МассивОбъектовДляЧтения.Добавить(ВыборкаВложеныхРеквизитовПоОбъектам.ЗначениеИсточникаАтрибутаКласса);
					КонецЕсли;
					Если СоответствиеРеквизитовДляЧтения[
							ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса] = Неопределено Тогда
						МетаданныеРеквизита = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(МетаданныеСпр, 
							ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса);
						СоответствиеРеквизитовДляЧтения.Вставить(
							ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса, МетаданныеРеквизита);
						СписокРеквизитов = СписокРеквизитов + ?(ПустаяСтрока(СписокРеквизитов), "", ",") + МетаданныеРеквизита.Имя;
					КонецЕсли;
				КонецЦикла;
				
				ЗначенияРеквизитов = УправлениеНСИФункцииВызовСервераПереопределяемый.ЗначенияРеквизитовОбъектов(
					МассивОбъектовДляЧтения, СписокРеквизитов);
				ВыборкаВложеныхРеквизитовПоОбъектам.Сбросить();
				Пока ВыборкаВложеныхРеквизитовПоОбъектам.Следующий() Цикл
					СтрокаВложенныхРеквизитов = ТаблицаВложенныхРеквизитов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаВложенныхРеквизитов, ВыборкаВложеныхРеквизитовПоОбъектам);
					
					МетаданныеРеквизита = СоответствиеРеквизитовДляЧтения[ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса];
					СтруктураЗначений = ЗначенияРеквизитов[ВыборкаВложеныхРеквизитовПоОбъектам.ЗначениеИсточникаАтрибутаКласса];
					
					СтрокаВложенныхРеквизитов.ЗначениеАтрибутаВложенногоКлассаНТ = СтруктураЗначений[МетаданныеРеквизита.Имя];
					СтрокаВложенныхРеквизитов.ТипЗначения = ЗначениеВСтрокуВнутр(МетаданныеРеквизита.Тип);
					
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТипов, МетаданныеРеквизита.Тип.Типы(), Истина);
					Если КвалификаторСтрока = Неопределено 
							ИЛИ КвалификаторСтрока.Длина < МетаданныеРеквизита.Тип.КвалификаторыСтроки.Длина Тогда
						КвалификаторСтрока = МетаданныеРеквизита.Тип.КвалификаторыСтроки;
					КонецЕсли;
				КонецЦикла;
			Иначе
				Пока ВыборкаВложеныхРеквизитовПоОбъектам.Следующий() Цикл
					МетаданныеРеквизита = СоответствиеРеквизитовДляЧтения[
							ВыборкаВложеныхРеквизитовПоОбъектам.ВложенныйАтрибутКлассаСсылка];
					Если МетаданныеРеквизита = Неопределено Тогда
						МетаданныеСпр = Метаданные.НайтиПоТипу(ВыборкаВложеныхРеквизитовПоОбъектам.ТипИсточника.Типы()[0]);
						МетаданныеРеквизита = Перечисления.РеквизитыКлассаНоменклатуры.ПолучитьМетаданныеРеквизита(МетаданныеСпр,
							ВыборкаВложеныхРеквизитовПоОбъектам.АтрибутВложенногоКласса);
						СоответствиеРеквизитовДляЧтения.Вставить(
							ВыборкаВложеныхРеквизитовПоОбъектам.ВложенныйАтрибутКлассаСсылка, МетаданныеРеквизита);
					КонецЕсли;
					
					Если МетаданныеРеквизита = Неопределено Тогда
						Продолжить;
					КонецЕсли;
					
					СтрокаВложенныхРеквизитов = ТаблицаВложенныхРеквизитов.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаВложенныхРеквизитов, ВыборкаВложеныхРеквизитовПоОбъектам);
					СтрокаВложенныхРеквизитов.ЗначениеАтрибутаВложенногоКлассаНТ = 
						ВыборкаВложеныхРеквизитовПоОбъектам.ЗначениеАтрибутаКласса;
					СтрокаВложенныхРеквизитов.ТипЗначения = ЗначениеВСтрокуВнутр(МетаданныеРеквизита.Тип);
					
					ОбщегоНазначенияКлиентСервер.ДополнитьМассив(МассивТипов, МетаданныеРеквизита.Тип.Типы(), Истина);
					Если КвалификаторСтрока = Неопределено 
							ИЛИ КвалификаторСтрока.Длина < МетаданныеРеквизита.Тип.КвалификаторыСтроки.Длина Тогда
						КвалификаторСтрока = МетаданныеРеквизита.Тип.КвалификаторыСтроки;
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
		
		Если МассивТипов.Количество() = 0 Тогда
			МассивТипов.Добавить(Тип("Число"));
		КонецЕсли;
		МассивТипов.Добавить(Тип("Неопределено"));
		
		ТаблицаВложенныхРеквизитов.Колонки.Добавить("ЗначениеАтрибутаВложенногоКласса", Новый ОписаниеТипов(МассивТипов,, КвалификаторСтрока));
		ЗначенияВыгрузка = ТаблицаВложенныхРеквизитов.ВыгрузитьКолонку("ЗначениеАтрибутаВложенногоКлассаНТ");
		ТаблицаВложенныхРеквизитов.ЗагрузитьКолонку(ЗначенияВыгрузка, "ЗначениеАтрибутаВложенногоКласса");
		ТаблицаВложенныхРеквизитов.Колонки.Удалить("ЗначениеАтрибутаВложенногоКлассаНТ");
		
		Запрос.УстановитьПараметр("ТаблицаВложенныхРеквизитов", ТаблицаВложенныхРеквизитов);
		
		Если МассивКлассовЧтенияВложенныхАтрибутов.Количество() > 0 Тогда
			ТаблицаРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(МассивКлассовЧтенияВложенныхАтрибутов);
			ТаблицаВложенныхАтрибутов = ПолучитьТаблицуАтрибутов(ТаблицаРодителей, , Ложь);
		КонецЕсли;
		
		Если МассивНоменклатурыЧтенияВложенныхАтрибутов.Количество() > 0 Тогда
			
			ТаблицаВложенныхАтрибутовНоменклатуры = Справочники.НоменклатураКласса.ПолучитьТаблицуАтрибутов(
				МассивНоменклатурыЧтенияВложенныхАтрибутов,,, Ложь);
			Если ТаблицаВложенныхАтрибутов = Неопределено Тогда
				ТаблицаВложенныхАтрибутов = ТаблицаВложенныхАтрибутовНоменклатуры;
			Иначе
				ТипКолонки = Новый ОписаниеТипов(
					ТаблицаВложенныхАтрибутов.Колонки.Объект.ТипЗначения, "СправочникСсылка.НоменклатураКласса");
				ТаблицаВложенныхАтрибутов.Колонки.Объект.Имя = "ОбъектУдалить";
				ТаблицаВложенныхАтрибутов.Колонки.Добавить("Объект", ТипКолонки);
				ЗначенияКолонки = ТаблицаВложенныхАтрибутов.ВыгрузитьКолонку("ОбъектУдалить");
				ТаблицаВложенныхАтрибутов.ЗагрузитьКолонку(ЗначенияКолонки, "Объект");
				
				Для Каждого СтрокаЗначений ИЗ ТаблицаВложенныхАтрибутовНоменклатуры Цикл
					НоваяСтрока = ТаблицаВложенныхАтрибутов.Добавить();
					ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаЗначений);
				КонецЦикла;
			КонецЕсли;
			
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ТаблицаАтрибутовВложенных", ТаблицаВложенныхАтрибутов);
		
	КонецЕсли;
	
	Если ЧитатьВложенныеАтрибуты И НЕ ТаблицаВложенныхАтрибутов = Неопределено Тогда
		Запрос.Текст = ТекстЗапросаЗначенияВложенныхАтрибутов(); // ВТ_ЗначенияВложенныхАтрибутов
	Иначе
		Запрос.Текст = ТекстЗапросаПустаяТаблицаЗначенияВложенныхАтрибутов(); // ВТ_ЗначенияВложенныхАтрибутов
	КонецЕсли;
	
	Если ЧитатьВложенныеАтрибуты И НЕ ТаблицаВложенныхРеквизитов = Неопределено Тогда
		Запрос.Текст = Запрос.Текст + УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
			+ ТекстЗапросаЗначенияВложенныхРеквизитов(); // ВТ_ЗначенияВложенныхРеквизитов
	Иначе
		Запрос.Текст = Запрос.Текст + УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
			+ ТекстЗапросаПустаяТаблицаЗначенияВложенныхРеквизитов(); // ВТ_ЗначенияВложенныхРеквизитов
	КонецЕсли;
	
	Запрос.Текст = Запрос.Текст + УправлениеНСИФункцииВызовСервераПереопределяемый.ТекстРазделителяЗапросовПакета()
		+ ТекстЗапросаАтрибутыНоменклатуры();
	
	Результат = Запрос.Выполнить();
	Если МенеджерВТ = Неопределено Тогда
		ТаблицаАтрибутов = Результат.Выгрузить();
		Запрос.МенеджерВременныхТаблиц.Закрыть();
	КонецЕсли;
	
	Возврат ТаблицаАтрибутов;
	
КонецФункции

Функция ПолучитьСтрокиТабличныхАтрибутов(Номенклатура, АтрибутыКласса, ДанныеДляЧтения=Неопределено) Экспорт
	
	Если НЕ ТипЗнч(Номенклатура) = Тип("Массив") Тогда
		МассивНоменклатуры = Новый Массив;
		МассивНоменклатуры.Добавить(Номенклатура);
	Иначе
		МассивНоменклатуры = Номенклатура;
	КонецЕсли;
	
	Если ДанныеДляЧтения = Неопределено Тогда
		ДанныеДляЧтения = ПрочитатьДанныеДляЧтенияНоменклатуры(МассивНоменклатуры);
	КонецЕсли;
	
	// Чтение строк шаблонов (классов) табличных атрибутов. 
	МенеджерВТ = Новый МенеджерВременныхТаблиц;
	
	СписокРодителей = Справочники.Классы.ПолучитьТаблицуРодителей(ДанныеДляЧтения.МассивКлассов);
	Справочники.Классы.ПолучитьТаблицуАтрибутов(СписокРодителей, МенеджерВТ);
	ТаблицаСтрокАтрибутовКласса = Справочники.Классы.ПолучитьСтрокиТабличныхАтрибутов(СписокРодителей, АтрибутыКласса);
	
	// Чтение строк номенклатуры табличных атрибутов.
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВТ;
	Запрос.УстановитьПараметр("ТаблицаСтрокАтрибутовКласса", ТаблицаСтрокАтрибутовКласса);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.Текст = ТекстЗапросаСтрокиТабличныхАтрибутов();
	ТаблицаАтрибутовНоменклатуры = Запрос.Выполнить().Выгрузить();
	
	Возврат ТаблицаАтрибутовНоменклатуры;
	
КонецФункции	

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаАтрибутыНоменклатуры()
	
	ТекстЗапроса = 
		"
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_НоменклатураКласса.Номенклатура,
		|	ВТ_ТаблицаАтрибутов.КлассДляЧтения,
		|	ВТ_ТаблицаАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ТаблицаАтрибутов.ТипЗначения,
		|	ВЫБОР 
		|		КОГДА ВТ_ТаблицаАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_ТаблицаАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|			ТОГДА ЕСТЬNULL(ВТ_ЗначенияВложенныхРеквизитов.ТипЗначения, ВТ_ТаблицаАтрибутов.ТипЗначенияРеквизита)
		|	КОНЕЦ КАК ТипЗначенияРеквизита,
		|	ВТ_ТаблицаАтрибутов.СтатусНаследования,
		|	ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаКлассаПоУмолчанию,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаАтрибутов.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ЕСТЬNULL(ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса, ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса)
		|		КОГДА ВТ_ТаблицаАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_ТаблицаАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|			ТОГДА ЕСТЬNULL(ВТ_ЗначенияВложенныхАтрибутов.ЗначениеАтрибутаВложенногоКласса, ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса) 
		|		КОГДА ВТ_ТаблицаАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса
		|				И ВЫРАЗИТЬ(ВТ_ТаблицаАтрибутов.АтрибутКласса КАК Справочник.ВложенныеАтрибутыКласса).АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|			ТОГДА ЕСТЬNULL(ВТ_ЗначенияВложенныхРеквизитов.ЗначениеАтрибутаВложенногоКласса, ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса)
		|	КОНЕЦ КАК ЗначениеАтрибутаКласса,
		|	ВТ_ТаблицаАтрибутов.УровеньЗначения,
		|	ВТ_ТаблицаАтрибутов.МножественноеЗначение,
		|	ВТ_ТаблицаАтрибутов.МножественноеЗначениеКартинка,
		|	ВТ_ТаблицаАтрибутов.СписокДоступныхЗначений,
		|	ВТ_ТаблицаАтрибутов.СписокДоступныхЗначенийПереключатель,
		|	ВТ_ТаблицаАтрибутов.ИсточникЗначений,
		|	ВТ_ТаблицаАтрибутов.КлассТабличнаяЧасть,
		|	ВТ_ТаблицаАтрибутов.РежимИспользования,
		|	ВТ_ТаблицаАтрибутов.РежимЗаполнения,
		|	ВТ_ТаблицаАтрибутов.РежимЗаполненияРодителя,
		|	ВТ_ТаблицаАтрибутов.МинЗначение,
		|	ВТ_ТаблицаАтрибутов.МаксЗначение,
		|	ВТ_ТаблицаАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ТаблицаАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ТаблицаАтрибутов.Формат,
		|	ВТ_ТаблицаАтрибутов.Порядок КАК Порядок
		|ПОМЕСТИТЬ ВТ_ТаблицаАтрибутовНоменклатурыКлассов
		|ИЗ
		|	ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураКласса КАК ВТ_НоменклатураКласса
		|		ПО ВТ_ТаблицаАтрибутов.КлассДляЧтения = ВТ_НоменклатураКласса.Класс
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АтрибутыНоменклатуры КАК ВТ_АтрибутыНоменклатуры
		|		ПО ВТ_ТаблицаАтрибутов.КлассДляЧтения = ВТ_АтрибутыНоменклатуры.Класс
		|			И ВТ_НоменклатураКласса.Номенклатура = ВТ_АтрибутыНоменклатуры.Номенклатура
		|			И ВТ_ТаблицаАтрибутов.АтрибутКласса = ВТ_АтрибутыНоменклатуры.АтрибутКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияВложенныхАтрибутов КАК ВТ_ЗначенияВложенныхАтрибутов
		|		ПО ВТ_НоменклатураКласса.Номенклатура = ВТ_ЗначенияВложенныхАтрибутов.Номенклатура
		|			И ВТ_ТаблицаАтрибутов.АтрибутКласса = ВТ_ЗначенияВложенныхАтрибутов.ВложенныйАтрибутКлассаСсылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ЗначенияВложенныхРеквизитов КАК ВТ_ЗначенияВложенныхРеквизитов
		|		ПО ВТ_НоменклатураКласса.Номенклатура = ВТ_ЗначенияВложенныхРеквизитов.Номенклатура
		|			И ВТ_ТаблицаАтрибутов.АтрибутКласса = ВТ_ЗначенияВложенныхРеквизитов.ВложенныйАтрибутКлассаСсылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ТаблицаАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.Номенклатура КАК Объект,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.АтрибутКласса,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.ТипЗначения,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.ТипЗначенияРеквизита,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.СтатусНаследования,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.ЗначениеАтрибутаКлассаПоУмолчанию,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.ЗначениеАтрибутаКласса,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.УровеньЗначения,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.МножественноеЗначение,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.МножественноеЗначениеКартинка,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.СписокДоступныхЗначений,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.СписокДоступныхЗначенийПереключатель,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.ИсточникЗначений,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.КлассТабличнаяЧасть,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.РежимИспользования,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.РежимЗаполнения,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.РежимЗаполненияРодителя,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.МинЗначение,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.МаксЗначение,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.Формат,
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов.Порядок
		|ПОМЕСТИТЬ ВТ_ТаблицаАтрибутов
		|ИЗ
		|	ВТ_ТаблицаАтрибутовНоменклатурыКлассов КАК ВТ_ТаблицаАтрибутовНоменклатурыКлассов";
		ТекстЗапроса = ТекстЗапроса + "
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_АтрибутыНоменклатуры
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ЗначенияВложенныхАтрибутов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ТаблицаАтрибутовНоменклатурыКлассов
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_НоменклатураКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаАтрибутов.Объект КАК Объект,
		|	ВТ_ТаблицаАтрибутов.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ТаблицаАтрибутов.ТипЗначения,
		|	ВТ_ТаблицаАтрибутов.ТипЗначенияРеквизита,
		|	ВТ_ТаблицаАтрибутов.СтатусНаследования,
		|	ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКлассаПоУмолчанию,
		|	ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса,
		|	ВТ_ТаблицаАтрибутов.УровеньЗначения,
		|	ВТ_ТаблицаАтрибутов.МножественноеЗначение,
		|	ВТ_ТаблицаАтрибутов.МножественноеЗначениеКартинка,
		|	ВТ_ТаблицаАтрибутов.СписокДоступныхЗначений,
		|	ВТ_ТаблицаАтрибутов.СписокДоступныхЗначенийПереключатель,
		|	ВТ_ТаблицаАтрибутов.ИсточникЗначений,
		|	ВТ_ТаблицаАтрибутов.КлассТабличнаяЧасть,
		|	ВТ_ТаблицаАтрибутов.РежимИспользования,
		|	ВТ_ТаблицаАтрибутов.РежимЗаполнения,
		|	ВТ_ТаблицаАтрибутов.РежимЗаполненияРодителя,
		|	ВТ_ТаблицаАтрибутов.МинЗначение,
		|	ВТ_ТаблицаАтрибутов.МаксЗначение,
		|	ВТ_ТаблицаАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса,
		|	ВТ_ТаблицаАтрибутов.ДобавлениеСтрокТабЧастиВОбъектахНоменклатуры,
		|	ВТ_ТаблицаАтрибутов.Формат,
		|	ВТ_ТаблицаАтрибутов.Порядок КАК Порядок
		|ИЗ
		|	ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|
		|УПОРЯДОЧИТЬ ПО
		|	Объект,
		|	АтрибутКласса,
		|	Порядок
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаСтрокиТабличныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаСтрокАтрибутовКласса.КлассДляЧтения,
		|	ТаблицаСтрокАтрибутовКласса.АтрибутКласса,
		|	ТаблицаСтрокАтрибутовКласса.ЗначениеАтрибутаКласса,
		|	ТаблицаСтрокАтрибутовКласса.Порядок,
		|	ТаблицаСтрокАтрибутовКласса.СтатусНаследования,
		|	ТаблицаСтрокАтрибутовКласса.Уровень,
		|	ТаблицаСтрокАтрибутовКласса.УровеньТекКласса + 1 КАК УровеньТекКласса,
		|	ТаблицаСтрокАтрибутовКласса.ИсточникЗначений
		|ПОМЕСТИТЬ ВТ_ТаблицаСтрокАтрибутовКласса
		|ИЗ
		|	&ТаблицаСтрокАтрибутовКласса КАК ТаблицаСтрокАтрибутовКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МножественныеЗначенияАтрибутов.Класс КАК Объект,
		|	ВЫРАЗИТЬ(МножественныеЗначенияАтрибутов.Класс КАК Справочник.НоменклатураКласса).Класс КАК КлассОбъекта,
		|	МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса,
		|	ВЫРАЗИТЬ(МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса КАК Справочник.НоменклатураКласса).Класс КАК КлассЗначения,
		|	МножественныеЗначенияАтрибутов.Порядок,
		|	МножественныеЗначенияАтрибутов.АтрибутКласса
		|ПОМЕСТИТЬ ВТ_МножественныеЗначенияАтрибутов
		|ИЗ
		|	РегистрСведений.МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|ГДЕ
		|	МножественныеЗначенияАтрибутов.Класс В(&Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(МножественныеЗначенияАтрибутов.Объект, ЕСТЬNULL(МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.Объект, ВТ_ТаблицаСтрокАтрибутовКласса.КлассДляЧтения)) КАК Объект,
		|	ВТ_ТаблицаСтрокАтрибутовКласса.АтрибутКласса КАК АтрибутКласса,
		|	ЕСТЬNULL(МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса, ЕСТЬNULL(МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.ЗначениеАтрибутаКласса, НЕОПРЕДЕЛЕНО)) КАК ЗначениеАтрибутаКласса,
		|	ВЫБОР 
		|		КОГДА НЕ ЕСТЬNULL(ВТ_ТаблицаАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса, ЛОЖЬ) 
		|			ТОГДА ВТ_ТаблицаСтрокАтрибутовКласса.Порядок
		|		КОГДА НЕ МножественныеЗначенияАтрибутов.Порядок ЕСТЬ NULL
		|			ТОГДА МножественныеЗначенияАтрибутов.Порядок
		|		КОГДА НЕ МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.Порядок ЕСТЬ NULL
		|			ТОГДА МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.Порядок
		|		ИНАЧЕ ВТ_ТаблицаСтрокАтрибутовКласса.Порядок 
		|	КОНЕЦ КАК Порядок,
		|	ВЫБОР
		|		КОГДА ВТ_ТаблицаСтрокАтрибутовКласса.ЗначениеАтрибутаКласса = ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка)
		|			ТОГДА ВТ_ТаблицаСтрокАтрибутовКласса.ИсточникЗначений
		|		ИНАЧЕ ВТ_ТаблицаСтрокАтрибутовКласса.ЗначениеАтрибутаКласса
		|	КОНЕЦ КАК ИсточникЗначений,
		|	3 КАК СтатусНаследования,
		|	ВЫБОР 
		|		КОГДА НЕ МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса ЕСТЬ NULL ИЛИ НЕ МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.ЗначениеАтрибутаКласса ЕСТЬ NULL 
		|			ТОГДА ВТ_ТаблицаСтрокАтрибутовКласса.УровеньТекКласса
		|		ИНАЧЕ ВТ_ТаблицаСтрокАтрибутовКласса.Уровень
		|	КОНЕЦ КАК Уровень,
		|	ВТ_ТаблицаСтрокАтрибутовКласса.УровеньТекКласса,
		|	ВЫБОР
		|		КОГДА НЕ МножественныеЗначенияАтрибутов.Объект ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		КОГДА НЕ МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.Объект ЕСТЬ NULL
		|			ТОГДА ИСТИНА
		|		ИНАЧЕ ЛОЖЬ
		|	КОНЕЦ КАК ЕстьСтрокаНоменклатуры
		|ПОМЕСТИТЬ ВТ_ТаблицаАтрибутовНоменклатуры
		|ИЗ
		|	ВТ_ТаблицаСтрокАтрибутовКласса КАК ВТ_ТаблицаСтрокАтрибутовКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутов
		|		ПО ВТ_ТаблицаСтрокАтрибутовКласса.КлассДляЧтения = МножественныеЗначенияАтрибутов.КлассОбъекта
		|			И ВТ_ТаблицаСтрокАтрибутовКласса.АтрибутКласса = МножественныеЗначенияАтрибутов.АтрибутКласса
		|			И ВТ_ТаблицаСтрокАтрибутовКласса.ЗначениеАтрибутаКласса = МножественныеЗначенияАтрибутов.КлассЗначения
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_МножественныеЗначенияАтрибутов КАК МножественныеЗначенияАтрибутовПоНаследуемымСтрокам
		|		ПО ВТ_ТаблицаСтрокАтрибутовКласса.КлассДляЧтения = МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.КлассОбъекта
		|			И ВТ_ТаблицаСтрокАтрибутовКласса.АтрибутКласса = МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.АтрибутКласса
		|			И (ВТ_ТаблицаСтрокАтрибутовКласса.ЗначениеАтрибутаКласса = ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка))
		|			И ВТ_ТаблицаСтрокАтрибутовКласса.ИсточникЗначений = МножественныеЗначенияАтрибутовПоНаследуемымСтрокам.КлассЗначения
		|			И (МножественныеЗначенияАтрибутов.Объект ЕСТЬ NULL)
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|		ПО ВТ_ТаблицаСтрокАтрибутовКласса.КлассДляЧтения = ВТ_ТаблицаАтрибутов.КлассДляЧтения
		|			И ВТ_ТаблицаСтрокАтрибутовКласса.АтрибутКласса = ВТ_ТаблицаАтрибутов.АтрибутКласса
		|ГДЕ
		|	ВТ_ТаблицаСтрокАтрибутовКласса.СтатусНаследования <= 3
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_МножественныеЗначенияАтрибутов.Объект,
		|	ВТ_МножественныеЗначенияАтрибутов.АтрибутКласса,
		|	ВТ_МножественныеЗначенияАтрибутов.ЗначениеАтрибутаКласса,
		|	ВТ_МножественныеЗначенияАтрибутов.Порядок,
		|	ВТ_МножественныеЗначенияАтрибутов.КлассЗначения,
		|	1,
		|	NULL,
		|	NULL,
		|	ИСТИНА
		|ИЗ
		|	ВТ_МножественныеЗначенияАтрибутов КАК ВТ_МножественныеЗначенияАтрибутов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|		ПО ВТ_МножественныеЗначенияАтрибутов.КлассОбъекта = ВТ_ТаблицаАтрибутов.КлассДляЧтения
		|			И ВТ_МножественныеЗначенияАтрибутов.АтрибутКласса = ВТ_ТаблицаАтрибутов.АтрибутКласса
		|			И ВТ_ТаблицаАтрибутов.ДобавлениеСтрокТабЧастиВНоменклатуреКласса
		|ГДЕ
		|	НЕ (ВТ_МножественныеЗначенияАтрибутов.КлассОбъекта, ВТ_МножественныеЗначенияАтрибутов.АтрибутКласса, ВТ_МножественныеЗначенияАтрибутов.КлассЗначения) В
		|				(ВЫБРАТЬ
		|					ВТ_ТаблицаСтрокАтрибутовКласса.КлассДляЧтения,
		|					ВТ_ТаблицаСтрокАтрибутовКласса.АтрибутКласса,
		|					ВТ_ТаблицаСтрокАтрибутовКласса.ЗначениеАтрибутаКласса
		|				ИЗ
		|					ВТ_ТаблицаСтрокАтрибутовКласса КАК ВТ_ТаблицаСтрокАтрибутовКласса
		|				ГДЕ
		|					ВТ_ТаблицаСтрокАтрибутовКласса.СтатусНаследования <= 3
		|		
		|				ОБЪЕДИНИТЬ
		|		
		|				ВЫБРАТЬ
		|					ВТ_ТаблицаСтрокАтрибутовКласса.КлассДляЧтения,
		|					ВТ_ТаблицаСтрокАтрибутовКласса.АтрибутКласса,
		|					ВТ_ТаблицаСтрокАтрибутовКласса.ИсточникЗначений
		|				ИЗ
		|					ВТ_ТаблицаСтрокАтрибутовКласса КАК ВТ_ТаблицаСтрокАтрибутовКласса
		|				ГДЕ
		|					ВТ_ТаблицаСтрокАтрибутовКласса.ЗначениеАтрибутаКласса = ЗНАЧЕНИЕ(Справочник.Классы.ПустаяСсылка)
		|					И ВТ_ТаблицаСтрокАтрибутовКласса.СтатусНаследования <= 3)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка КАК Номенклатура,
		|	НоменклатураКласса.Класс
		|ПОМЕСТИТЬ ВТ_НоменклатураКласса
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Ссылка В(&Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ТаблицаАтрибутовНоменклатуры.Объект КАК Объект,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.АтрибутКласса КАК АтрибутКласса,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.ЗначениеАтрибутаКласса,
		|	ЕСТЬNULL(ВЫРАЗИТЬ(ВТ_ТаблицаАтрибутовНоменклатуры.ЗначениеАтрибутаКласса КАК Справочник.НоменклатураКласса).Наименование, """") КАК Наименование,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.Порядок КАК Порядок,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.ИсточникЗначений,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.СтатусНаследования,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.Уровень,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.УровеньТекКласса
		|ИЗ
		|	ВТ_ТаблицаАтрибутовНоменклатуры КАК ВТ_ТаблицаАтрибутовНоменклатуры
		|ГДЕ
		|	ВТ_ТаблицаАтрибутовНоменклатуры.ЕстьСтрокаНоменклатуры
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	ВТ_НоменклатураКласса.Номенклатура,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.АтрибутКласса,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.ЗначениеАтрибутаКласса,
		|	"""",
		|	ВТ_ТаблицаАтрибутовНоменклатуры.Порядок,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.ИсточникЗначений,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.СтатусНаследования,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.Уровень,
		|	ВТ_ТаблицаАтрибутовНоменклатуры.УровеньТекКласса
		|ИЗ
		|	ВТ_ТаблицаАтрибутовНоменклатуры КАК ВТ_ТаблицаАтрибутовНоменклатуры
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураКласса КАК ВТ_НоменклатураКласса
		|		ПО ВТ_ТаблицаАтрибутовНоменклатуры.Объект = ВТ_НоменклатураКласса.Класс
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НенаследуемыеЗначения КАК НенаследуемыеЗначения
		|		ПО ВТ_НоменклатураКласса.Номенклатура = НенаследуемыеЗначения.Класс
		|			И ВТ_ТаблицаАтрибутовНоменклатуры.АтрибутКласса = НенаследуемыеЗначения.АтрибутКласса
		|			И ВТ_ТаблицаАтрибутовНоменклатуры.ЗначениеАтрибутаКласса = НенаследуемыеЗначения.ЗначениеАтрибутаКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.НенаследуемыеЗначения КАК НенаследуемыеЗначенияПоНаследуемымСтрокам
		|		ПО ВТ_НоменклатураКласса.Номенклатура = НенаследуемыеЗначенияПоНаследуемымСтрокам.Класс
		|			И ВТ_ТаблицаАтрибутовНоменклатуры.АтрибутКласса = НенаследуемыеЗначенияПоНаследуемымСтрокам.АтрибутКласса
		|			И ВТ_ТаблицаАтрибутовНоменклатуры.ЗначениеАтрибутаКласса = НЕОПРЕДЕЛЕНО
		|			И ВТ_ТаблицаАтрибутовНоменклатуры.ИсточникЗначений = НенаследуемыеЗначенияПоНаследуемымСтрокам.ЗначениеАтрибутаКласса
		|ГДЕ
		|	НЕ ВТ_ТаблицаАтрибутовНоменклатуры.ЕстьСтрокаНоменклатуры
		|		И НенаследуемыеЗначения.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|		И НенаследуемыеЗначенияПоНаследуемымСтрокам.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|
		|УПОРЯДОЧИТЬ ПО
		|	Объект,
		|	АтрибутКласса,
		|	Порядок
		|АВТОУПОРЯДОЧИВАНИЕ";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗначенияАтрибутовНоменклатуры()

	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	НоменклатураКласса.Ссылка КАК Номенклатура,
		|	НоменклатураКласса.Класс
		|ПОМЕСТИТЬ ВТ_НоменклатураКласса
		|ИЗ
		|	Справочник.НоменклатураКласса КАК НоменклатураКласса
		|ГДЕ
		|	НоменклатураКласса.Ссылка В(&Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВЫРАЗИТЬ(ЗначенияАтрибутовКласса.Класс КАК Справочник.НоменклатураКласса) КАК Номенклатура,
		|	ВЫРАЗИТЬ(ЗначенияАтрибутовКласса.Класс КАК Справочник.НоменклатураКласса).Класс КАК Класс,
		|	ЗначенияАтрибутовКласса.АтрибутКласса,
		|	ЗначенияАтрибутовКласса.ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_АтрибутыНоменклатуры
		|ИЗ
		|	РегистрСведений.ЗначенияАтрибутовКласса КАК ЗначенияАтрибутовКласса
		|ГДЕ
		|	ЗначенияАтрибутовКласса.Класс В(&Номенклатура)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ 
		|	ВТ_НоменклатураКласса.Номенклатура,
		|	ВТ_ТаблицаАтрибутов.КлассДляЧтения,
		|	ВТ_ТаблицаАтрибутов.АтрибутКласса КАК ВложенныйАтрибутКласса,
		|	ВложенныеАтрибутыКласса.Источник,
		|	ВложенныеАтрибутыКласса.АтрибутКласса,
		|	ВТ_ТаблицаАтрибутов.ТипЗначенияРеквизита,
		|	ВТ_ТаблицаАтрибутов.ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_ВложенныеАтрибутыКласса
		|ИЗ
		|	ВТ_ТаблицаАтрибутов КАК ВТ_ТаблицаАтрибутов
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_НоменклатураКласса КАК ВТ_НоменклатураКласса
		|		ПО ВТ_ТаблицаАтрибутов.КлассДляЧтения = ВТ_НоменклатураКласса.Класс
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВложенныеАтрибутыКласса КАК ВложенныеАтрибутыКласса
		|		ПО ВТ_ТаблицаАтрибутов.АтрибутКласса = ВложенныеАтрибутыКласса.Ссылка
		|ГДЕ
		|	ВТ_ТаблицаАтрибутов.АтрибутКласса ССЫЛКА Справочник.ВложенныеАтрибутыКласса";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаВложенныеАтрибуты()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_АтрибутыНоменклатуры КАК ВТ_АтрибутыНоменклатуры
		|ГДЕ
		|	(ВТ_АтрибутыНоменклатуры.Номенклатура, ВТ_АтрибутыНоменклатуры.АтрибутКласса) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_ВложенныеАтрибутыКласса.Номенклатура,
		|				ВТ_ВложенныеАтрибутыКласса.Источник
		|			ИЗ
		|				ВТ_ВложенныеАтрибутыКласса)
		|	И ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса ССЫЛКА Справочник.Классы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_АтрибутыНоменклатуры КАК ВТ_АтрибутыНоменклатуры
		|ГДЕ
		|	(ВТ_АтрибутыНоменклатуры.Номенклатура, ВТ_АтрибутыНоменклатуры.АтрибутКласса) В
		|			(ВЫБРАТЬ РАЗЛИЧНЫЕ
		|				ВТ_ВложенныеАтрибутыКласса.Номенклатура,
		|				ВТ_ВложенныеАтрибутыКласса.Источник
		|			ИЗ
		|				ВТ_ВложенныеАтрибутыКласса)
		|	И ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса ССЫЛКА Справочник.НоменклатураКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВложенныеАтрибутыКласса.Номенклатура,
		|	ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|	ВТ_ВложенныеАтрибутыКласса.ВложенныйАтрибутКласса КАК ВложенныйАтрибутКлассаСсылка,
		|	ВТ_ВложенныеАтрибутыКласса.Источник КАК ИсточникВложенногоАтрибутаКласса,
		|	ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса КАК ЗначениеИсточникаАтрибутаКласса,
		|	ВЫБОР
		|		КОГДА НЕ ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса ЕСТЬ NULL
		|			ТОГДА ТИПЗНАЧЕНИЯ(ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса)
		|	КОНЕЦ КАК ТипЗначенияИсточника,
		|	ВЫРАЗИТЬ(ВТ_ВложенныеАтрибутыКласса.Источник КАК ПланВидовХарактеристик.АтрибутыКласса).ТипЗначения КАК ТипИсточника,
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса КАК АтрибутВложенногоКласса,
		|	ВТ_ВложенныеАтрибутыКласса.ЗначениеАтрибутаКласса
		|ИЗ
		|	ВТ_ВложенныеАтрибутыКласса КАК ВТ_ВложенныеАтрибутыКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_АтрибутыНоменклатуры КАК ВТ_АтрибутыНоменклатуры
		|		ПО ВТ_ВложенныеАтрибутыКласса.Номенклатура = ВТ_АтрибутыНоменклатуры.Номенклатура
		|			И ВТ_ВложенныеАтрибутыКласса.Источник = ВТ_АтрибутыНоменклатуры.АтрибутКласса
		|ГДЕ
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры
		|ИТОГИ ПО
		|	ТипЗначенияИсточника";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗначенияВложенныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаАтрибутовВложенных.Объект,
		|	ТаблицаАтрибутовВложенных.АтрибутКласса,
		|	ТаблицаАтрибутовВложенных.ЗначениеАтрибутаКласса
		|ПОМЕСТИТЬ ВТ_ТаблицаАтрибутовВложенных
		|ИЗ
		|	&ТаблицаАтрибутовВложенных КАК ТаблицаАтрибутовВложенных
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВложенныеАтрибутыКласса.Номенклатура,
		|	ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|	ВТ_ВложенныеАтрибутыКласса.ВложенныйАтрибутКласса КАК ВложенныйАтрибутКлассаСсылка,
		|	ВТ_ВложенныеАтрибутыКласса.Источник КАК ИсточникВложенногоАтрибутаКласса,
		|	ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса КАК ЗначениеИсточникаАтрибутаКласса,
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса КАК АтрибутВложенногоКласса,
		|	ВТ_ТаблицаАтрибутовВложенных.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаВложенногоКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияВложенныхАтрибутов
		|ИЗ
		|	ВТ_ВложенныеАтрибутыКласса КАК ВТ_ВложенныеАтрибутыКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АтрибутыНоменклатуры КАК ВТ_АтрибутыНоменклатуры
		|		ПО ВТ_ВложенныеАтрибутыКласса.Номенклатура = ВТ_АтрибутыНоменклатуры.Номенклатура
		|			И ВТ_ВложенныеАтрибутыКласса.Источник = ВТ_АтрибутыНоменклатуры.АтрибутКласса
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ТаблицаАтрибутовВложенных КАК ВТ_ТаблицаАтрибутовВложенных
		|		ПО (ВТ_АтрибутыНоменклатуры.ЗначениеАтрибутаКласса = ВТ_ТаблицаАтрибутовВложенных.Объект)
		|			И ВТ_ВложенныеАтрибутыКласса.АтрибутКласса = ВТ_ТаблицаАтрибутовВложенных.АтрибутКласса
		|ГДЕ 
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ВТ_ТаблицаАтрибутовВложенных";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПустаяТаблицаЗначенияВложенныхАтрибутов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ВложенныеАтрибутыКласса.Номенклатура,
		|	ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|	ВТ_ВложенныеАтрибутыКласса.ВложенныйАтрибутКласса КАК ВложенныйАтрибутКлассаСсылка,
		|	ВТ_ВложенныеАтрибутыКласса.Источник КАК ИсточникВложенногоАтрибутаКласса,
		|	НЕОПРЕДЕЛЕНО КАК ЗначениеАтрибутаВложенногоКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияВложенныхАтрибутов
		|ИЗ
		|	ВТ_ВложенныеАтрибутыКласса КАК ВТ_ВложенныеАтрибутыКласса
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_АтрибутыНоменклатуры КАК ВТ_АтрибутыНоменклатуры
		|		ПО ВТ_ВложенныеАтрибутыКласса.Номенклатура = ВТ_АтрибутыНоменклатуры.Номенклатура
		|			И ВТ_ВложенныеАтрибутыКласса.Источник = ВТ_АтрибутыНоменклатуры.АтрибутКласса
		|ГДЕ 
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА ПланВидовХарактеристик.АтрибутыКласса";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаЗначенияВложенныхРеквизитов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ТаблицаВложенныхРеквизитов.Номенклатура,
		|	ТаблицаВложенныхРеквизитов.КлассДляЧтения,
		|	ТаблицаВложенныхРеквизитов.ВложенныйАтрибутКлассаСсылка,
		|	ТаблицаВложенныхРеквизитов.ТипЗначения,
		|	ТаблицаВложенныхРеквизитов.ИсточникВложенногоАтрибутаКласса,
		|	ТаблицаВложенныхРеквизитов.ЗначениеАтрибутаВложенногоКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияВложенныхРеквизитов
		|ИЗ
		|	&ТаблицаВложенныхРеквизитов КАК ТаблицаВложенныхРеквизитов";
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаПустаяТаблицаЗначенияВложенныхРеквизитов()
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ВТ_ВложенныеАтрибутыКласса.Номенклатура,
		|	ВТ_ВложенныеАтрибутыКласса.КлассДляЧтения,
		|	ВТ_ВложенныеАтрибутыКласса.Источник КАК ИсточникВложенногоАтрибутаКласса,
		|	ВТ_ВложенныеАтрибутыКласса.ВложенныйАтрибутКласса КАК ВложенныйАтрибутКлассаСсылка,
		|	ВТ_ВложенныеАтрибутыКласса.ТипЗначенияРеквизита КАК ТипЗначения,
		|	ВТ_ВложенныеАтрибутыКласса.ЗначениеАтрибутаКласса КАК ЗначениеАтрибутаВложенногоКласса
		|ПОМЕСТИТЬ ВТ_ЗначенияВложенныхРеквизитов
		|ИЗ
		|	ВТ_ВложенныеАтрибутыКласса КАК ВТ_ВложенныеАтрибутыКласса
		|ГДЕ 
		|	ВТ_ВложенныеАтрибутыКласса.АтрибутКласса ССЫЛКА Перечисление.РеквизитыКлассаНоменклатуры";
	Возврат ТекстЗапроса;
	
КонецФункции

#КонецОбласти
